; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-92)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 - object)
 (:init 
    (arm-empty)
    (clear b23)
    (on b23 b2)
    (on b2 b11)
    (on b11 b9)
    (on-table b9)
    (clear b12)
    (on b12 b19)
    (on b19 b16)
    (on b16 b7)
    (on b7 b1)
    (on b1 b27)
    (on-table b27)
    (clear b17)
    (on b17 b20)
    (on b20 b15)
    (on b15 b13)
    (on b13 b5)
    (on b5 b26)
    (on b26 b8)
    (on b8 b21)
    (on b21 b3)
    (on b3 b4)
    (on b4 b14)
    (on b14 b25)
    (on-table b25)
    (clear b22)
    (on b22 b18)
    (on b18 b24)
    (on b24 b6)
    (on b6 b10)
    (on-table b10))
 (:goal (and 
(on b24 b21)
))
)

; plan
1. (unstack b17 b20)
   deleted: (on b17 b20) (clear b17) (arm-empty)
   added: (holding b17) (clear b20)
   goals met: 0 of 1
2. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 1
3. (unstack b20 b15)
   deleted: (on b20 b15) (clear b20) (arm-empty)
   added: (holding b20) (clear b15)
   goals met: 0 of 1
4. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 1
5. (unstack b15 b13)
   deleted: (on b15 b13) (clear b15) (arm-empty)
   added: (holding b15) (clear b13)
   goals met: 0 of 1
6. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 0 of 1
7. (unstack b13 b5)
   deleted: (on b13 b5) (clear b13) (arm-empty)
   added: (holding b13) (clear b5)
   goals met: 0 of 1
8. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 1
9. (unstack b5 b26)
   deleted: (on b5 b26) (clear b5) (arm-empty)
   added: (holding b5) (clear b26)
   goals met: 0 of 1
10. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 1
11. (unstack b26 b8)
   deleted: (on b26 b8) (clear b26) (arm-empty)
   added: (holding b26) (clear b8)
   goals met: 0 of 1
12. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 0 of 1
13. (unstack b22 b18)
   deleted: (on b22 b18) (clear b22) (arm-empty)
   added: (holding b22) (clear b18)
   goals met: 0 of 1
14. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 1
15. (unstack b18 b24)
   deleted: (on b18 b24) (clear b18) (arm-empty)
   added: (holding b18) (clear b24)
   goals met: 0 of 1
16. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 1
17. (unstack b8 b21)
   deleted: (on b8 b21) (clear b8) (arm-empty)
   added: (holding b8) (clear b21)
   goals met: 0 of 1
18. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 1
19. (unstack b24 b6)
   deleted: (on b24 b6) (clear b24) (arm-empty)
   added: (holding b24) (clear b6)
   goals met: 0 of 1
20. (stack b24 b21)
   deleted: (clear b21) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b21)
   goals met: 1 of 1
